Ren666Ming/Template/mdk/RTE/Board_Support/LPC54608J512ET180_M4/pin_mux.c
                        /* Selects pin function.: PORT30 (pin D12) is configured as LCD_VD(14) */
                        | IOCON_PIO_FUNC(PIO30_FUNC_ALT1)

                        /* Select Analog/Digital mode.: Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO30_DIGIMODE_DIGITAL));

    IOCON->PIO[3][1] = ((IOCON->PIO[3][1] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Selects pin function.: PORT31 (pin D11) is configured as LCD_VD(15) */
                        | IOCON_PIO_FUNC(PIO31_FUNC_ALT1)

                        /* Select Analog/Digital mode.: Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO31_DIGIMODE_DIGITAL));

    IOCON->PIO[3][15] = ((IOCON->PIO[3][15] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.: PORT315 (pin D2) is configured as SD_WR_PRT */
                         | IOCON_PIO_FUNC(PIO315_FUNC_ALT2)

                         /* Select Analog/Digital mode.: Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO315_DIGIMODE_DIGITAL));

    IOCON->PIO[3][23] = ((IOCON->PIO[3][23] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.: PORT323 (pin C2) is configured as FC2_CTS_SDA_SSEL0 */
                         | IOCON_PIO_FUNC(PIO323_FUNC_ALT1)

                         /* Select Analog/Digital mode.: Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO323_DIGIMODE_DIGITAL));

    IOCON->PIO[3][24] = ((IOCON->PIO[3][24] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.: PORT324 (pin E2) is configured as FC2_RTS_SCL_SSEL1 */
                         | IOCON_PIO_FUNC(PIO324_FUNC_ALT1)

                         /* Select Analog/Digital mode.: Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO324_DIGIMODE_DIGITAL));

    IOCON->PIO[3][25] = ((IOCON->PIO[3][25] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.: PORT325 (pin P9) is configured as EMC_A(14) */
                         | IOCON_PIO_FUNC(PIO325_FUNC_ALT6)

                         /* Select Analog/Digital mode.: Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO325_DIGIMODE_DIGITAL));

    IOCON->PIO[3][5] = ((IOCON->PIO[3][5] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Selects pin function.: PORT35 (pin B10) is configured as LCD_VD(19) */
                        | IOCON_PIO_FUNC(PIO35_FUNC_ALT1)

                        /* Select Analog/Digital mode.: Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO35_DIGIMODE_DIGITAL));

    IOCON->PIO[3][6] = ((IOCON->PIO[3][6] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Selects pin function.: PORT36 (pin C9) is configured as LCD_VD(20) */
                        | IOCON_PIO_FUNC(PIO36_FUNC_ALT1)

                        /* Select Analog/Digital mode.: Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO36_DIGIMODE_DIGITAL));

    IOCON->PIO[3][7] = ((IOCON->PIO[3][7] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Selects pin function.: PORT37 (pin B8) is configured as LCD_VD(21) */
                        | IOCON_PIO_FUNC(PIO37_FUNC_ALT1)

                        /* Select Analog/Digital mode.: Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO37_DIGIMODE_DIGITAL));

    IOCON->PIO[3][8] = ((IOCON->PIO[3][8] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Selects pin function.: PORT38 (pin A7) is configured as LCD_VD(22) */
                        | IOCON_PIO_FUNC(PIO38_FUNC_ALT1)

                        /* Select Analog/Digital mode.: Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO38_DIGIMODE_DIGITAL));

    IOCON->PIO[3][9] = ((IOCON->PIO[3][9] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Selects pin function.: PORT39 (pin C7) is configured as LCD_VD(23) */
                        | IOCON_PIO_FUNC(PIO39_FUNC_ALT1)

                        /* Select Analog/Digital mode.: Digital mode. */
                        | IOCON_PIO_DIGIMODE(PIO39_DIGIMODE_DIGITAL));
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
